Tekla Open API Reference for Tekla Structures 2025
Operation.CreateBentPlateByParts Method (Part, Part)
 Modifies the first plate by adding a cylindrical bend that connects it to the second plate creating a new BentPlate instance based on two parts. See CreateBentPlateByParts(Part, Part, BentPlate.BendShape).
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static BentPlate CreateBentPlateByParts(
	Part part1,
	Part part2
)
Public Shared Function CreateBentPlateByParts (
	part1 As Part,
	part2 As Part
) As BentPlate
Parameters
part1
Type: Tekla.Structures.Model.Part
One part used for creating the bent plate.
part2
Type: Tekla.Structures.Model.Part
The other part used for creating the bent plate.
Return Value
Type: BentPlate
The bent plate object if successful, null otherwise.
See Also
Reference
Operation Class
CreateBentPlateByParts Overload
Tekla.Structures.Model.Operations Namespace